When creating an opening, you cannot sketch loops within other loops. The highlighted loop(s) are contained within another loop.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId ContainedInOtherLoops { get; }
  Visual Basic
Public Shared ReadOnly Property ContainedInOtherLoops As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ ContainedInOtherLoops {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SketchFailures Class
  Autodesk.Revit.DB Namespace